In [106]:
import numpy as np
import pandas as pd

In [107]:
data = np.random.randn(4, 3)

In [108]:
data

array([[-0.66283152,  0.51295364,  0.06775126],
       [-1.26528592,  0.51510152,  0.62427494],
       [ 1.55792854, -2.15843394,  0.90830016],
       [ 0.65117424, -0.73520833,  0.5327167 ]])

In [109]:
dataFrame = pd.DataFrame(data)

In [110]:
dataFrame

          0         1         2
0 -0.662832  0.512954  0.067751
1 -1.265286  0.515102  0.624275
2  1.557929 -2.158434  0.908300
3  0.651174 -0.735208  0.532717

In [111]:
dataFrame[0]

0   -0.662832
1   -1.265286
2    1.557929
3    0.651174
Name: 0, dtype: float64

In [112]:
newDataFrame = pd.DataFrame(data, index= ["Utku", "Berfin", "Osman", "Ali"], columns= ["Salary", "Age", "Work Hours"])

In [113]:
newDataFrame

          Salary       Age  Work Hours
Utku   -0.662832  0.512954    0.067751
Berfin -1.265286  0.515102    0.624275
Osman   1.557929 -2.158434    0.908300
Ali     0.651174 -0.735208    0.532717

In [114]:
newDataFrame["Age"]

Utku      0.512954
Berfin    0.515102
Osman    -2.158434
Ali      -0.735208
Name: Age, dtype: float64

In [115]:
newDataFrame[["Salary", "Age"]]

          Salary       Age
Utku   -0.662832  0.512954
Berfin -1.265286  0.515102
Osman   1.557929 -2.158434
Ali     0.651174 -0.735208

In [116]:
newDataFrame.loc["Utku"]

Salary       -0.662832
Age           0.512954
Work Hours    0.067751
Name: Utku, dtype: float64

In [117]:
newDataFrame.iloc[1]

Salary       -1.265286
Age           0.515102
Work Hours    0.624275
Name: Berfin, dtype: float64

In [118]:
newDataFrame["Retirement Age"] = newDataFrame["Age"] + newDataFrame["Age"]

In [119]:
newDataFrame

          Salary       Age  Work Hours  Retirement Age
Utku   -0.662832  0.512954    0.067751        1.025907
Berfin -1.265286  0.515102    0.624275        1.030203
Osman   1.557929 -2.158434    0.908300       -4.316868
Ali     0.651174 -0.735208    0.532717       -1.470417

In [120]:
newDataFrame.drop("Retirement Age", axis = 1)

          Salary       Age  Work Hours
Utku   -0.662832  0.512954    0.067751
Berfin -1.265286  0.515102    0.624275
Osman   1.557929 -2.158434    0.908300
Ali     0.651174 -0.735208    0.532717

In [121]:
newDataFrame.drop("Osman", axis= 0)

          Salary       Age  Work Hours  Retirement Age
Utku   -0.662832  0.512954    0.067751        1.025907
Berfin -1.265286  0.515102    0.624275        1.030203
Ali     0.651174 -0.735208    0.532717       -1.470417

In [122]:
newDataFrame

          Salary       Age  Work Hours  Retirement Age
Utku   -0.662832  0.512954    0.067751        1.025907
Berfin -1.265286  0.515102    0.624275        1.030203
Osman   1.557929 -2.158434    0.908300       -4.316868
Ali     0.651174 -0.735208    0.532717       -1.470417

In [123]:
newDataFrame.drop("Retirement Age", axis= 1, inplace= True)

In [124]:
newDataFrame

          Salary       Age  Work Hours
Utku   -0.662832  0.512954    0.067751
Berfin -1.265286  0.515102    0.624275
Osman   1.557929 -2.158434    0.908300
Ali     0.651174 -0.735208    0.532717

In [125]:
newDataFrame.loc["Utku"]["Salary"]

-0.6628315203268733

In [126]:
newDataFrame.loc["Utku", "Salary"]

-0.6628315203268733

In [127]:
newDataFrame

          Salary       Age  Work Hours
Utku   -0.662832  0.512954    0.067751
Berfin -1.265286  0.515102    0.624275
Osman   1.557929 -2.158434    0.908300
Ali     0.651174 -0.735208    0.532717

In [128]:
newDataFrame < 0

        Salary    Age  Work Hours
Utku      True  False       False
Berfin    True  False       False
Osman    False   True       False
Ali      False   True       False

In [129]:
booleanFrame = newDataFrame < 0

In [130]:
booleanFrame

        Salary    Age  Work Hours
Utku      True  False       False
Berfin    True  False       False
Osman    False   True       False
Ali      False   True       False

In [131]:
newDataFrame

          Salary       Age  Work Hours
Utku   -0.662832  0.512954    0.067751
Berfin -1.265286  0.515102    0.624275
Osman   1.557929 -2.158434    0.908300
Ali     0.651174 -0.735208    0.532717

In [132]:
newDataFrame[booleanFrame]

          Salary       Age  Work Hours
Utku   -0.662832       NaN         NaN
Berfin -1.265286       NaN         NaN
Osman        NaN -2.158434         NaN
Ali          NaN -0.735208         NaN

In [133]:
newDataFrame[newDataFrame["Age"] > 0]

          Salary       Age  Work Hours
Utku   -0.662832  0.512954    0.067751
Berfin -1.265286  0.515102    0.624275

In [134]:
newDataFrame.reset_index()

    index    Salary       Age  Work Hours
0    Utku -0.662832  0.512954    0.067751
1  Berfin -1.265286  0.515102    0.624275
2   Osman  1.557929 -2.158434    0.908300
3     Ali  0.651174 -0.735208    0.532717

In [135]:
newIndexList = ["Utk", "Bef", "Osm", "Ali"]

In [136]:
newDataFrame["New Index"] = newIndexList

In [137]:
newDataFrame

          Salary       Age  Work Hours New Index
Utku   -0.662832  0.512954    0.067751       Utk
Berfin -1.265286  0.515102    0.624275       Bef
Osman   1.557929 -2.158434    0.908300       Osm
Ali     0.651174 -0.735208    0.532717       Ali

In [138]:
newDataFrame.set_index("New Index")

             Salary       Age  Work Hours
New Index
Utk       -0.662832  0.512954    0.067751
Bef       -1.265286  0.515102    0.624275
Osm        1.557929 -2.158434    0.908300
Ali        0.651174 -0.735208    0.532717

In [139]:
newDataFrame

          Salary       Age  Work Hours New Index
Utku   -0.662832  0.512954    0.067751       Utk
Berfin -1.265286  0.515102    0.624275       Bef
Osman   1.557929 -2.158434    0.908300       Osm
Ali     0.651174 -0.735208    0.532717       Ali

In [140]:
newDataFrame.set_index("New Index", inplace= True)

In [141]:
newDataFrame

             Salary       Age  Work Hours
New Index
Utk       -0.662832  0.512954    0.067751
Bef       -1.265286  0.515102    0.624275
Osm        1.557929 -2.158434    0.908300
Ali        0.651174 -0.735208    0.532717

In [142]:
newDataFrame.loc["Utk"]

Salary       -0.662832
Age           0.512954
Work Hours    0.067751
Name: Utk, dtype: float64

In [143]:
firstIndexes = ["Simpson", "Simpson", "Simpson", "South Park", "South Park", "South Park"]

In [144]:
innerIndexes = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [145]:
mergedIndex = list(zip(firstIndexes, innerIndexes))

In [146]:
mergedIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [147]:
mergedIndex = pd.MultiIndex.from_tuples(mergedIndex)

In [148]:
mergedIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [149]:
myCartoonList = [[40, "A"], [10, "B"], [30, "C"], [9, "D"], [10, "E"], [11, "F"]]

In [150]:
myCartoonNumpyList = np.array(myCartoonList)

In [151]:
myCartoonDataFrame = pd.DataFrame(myCartoonNumpyList, index= mergedIndex, columns= ["Age", "Job"])

In [152]:
myCartoonDataFrame

                   Age Job
Simpson    Homer    40   A
           Bart     10   B
           Marge    30   C
South Park Cartman   9   D
           Kenny    10   E
           Kyle     11   F

In [153]:
myCartoonDataFrame.loc["Simpson"]

      Age Job
Homer  40   A
Bart   10   B
Marge  30   C

In [154]:
myCartoonDataFrame.loc["Simpson"].loc["Bart"]

Age    10
Job     B
Name: Bart, dtype: object

In [155]:
myCartoonDataFrame.index.names = ["Cartoon Name", "Name"]

In [156]:
myCartoonDataFrame

                     Age Job
Cartoon Name Name
Simpson      Homer    40   A
             Bart     10   B
             Marge    30   C
South Park   Cartman   9   D
             Kenny    10   E
             Kyle     11   F